Revit 2027 API
FamilyInstance.CanSplit Property
Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double)).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSplit { get; }
Public ReadOnly Property CanSplit As Boolean
	Get
public:
property bool CanSplit {
	bool get ();
}
member CanSplit : bool with get
Property Value
Boolean
True if the family instance can be split, otherwise false.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace